demo-output/website/dafoam/f6a_epistemic_band/channel1_rans_sweep/SpalartAllmaras/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../caseDef"

// standard SA initialisation ~5*nu (OpenFOAM tutorial convention, same as
// the duct RANS_MODEL_COMPARISON.md sweep's SpalartAllmaras/0/nuTilda)
nuTildaInlet    #calc "5.0*$nu";

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform $nuTildaInlet;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $nuTildaInlet;
    }

    bottom
    {
        type            fixedValue;
        value           uniform 0;
    }

    outlet
    {
        type            zeroGradient;
    }

    sides
    {
        type            empty;
    }

    top
    {
        type            symmetry;
    }

}

// ************************************************************************* //
