demo-output/website/dafoam/f6a_epistemic_band/channel1_rans_sweep/SpalartAllmaras/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-8;
        relTol          0.1;
        smoother        GaussSeidel;
    }

    "(U|nuTilda)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.1;
    }


}

SIMPLE
{
    nNonOrthogonalCorrectors 1;

    // SpalartAllmaras transports one turbulence field (nuTilda) instead of
    // baseline's two (k, omega). Same 5e-7 bracket the baseline used for
    // "(U|p|k)" applied to nuTilda -- single change (field name), same
    // convergence criterion, not a different tolerance.
    residualControl
    {
        "(U|p|nuTilda)" 5e-7;
    }
    consistent          yes;
}

relaxationFactors
{

    equations
    {
        U               0.9;
        nuTilda         0.7;
    }
}


// ************************************************************************* //
