demo-output/website/dafoam/f6a_epistemic_band/channel1_rans_sweep/SpalartAllmaras/system/gradU
gradU
{     
// Mandatory entries     
type            grad;     
libs            ("libfieldFunctionObjects.so");     
field           U;     

// Optional (inherited) entries     
result          gradU;     
}
